<script>
export default {
  data() {
    return {
      num:1,
      title:"第1章",
      text:[
        "“刘老爷，您且放心，咱们庙子里的猫儿个个都有好本领，捉鼠拿虫不在话下\n" +
        "\"老爷我听说你们庙子里的猫儿不仅能捉鼠拿虫，还能驱祟镇宅?\"几6“那是自然了，咱们庙子里供奉的那是谁?隆鼠将军，专保家宅平安。”四“您往这边走，小心门槛，莫要绊倒了--\"\n" +
        "交谈声由远及近，李茂抬爪挠了挠耳朵，睁开眼睛注视着走进小院的一男一女女的是个嘴里只剩几颗牙的老妪，男的穿着讲究，看打扮应该是镇子上的乡绅人\n" +
        "物\n" +
        "李茂只看了一眼就收回目光，向后缩了缩。\n" +
        "现在阳光好，正适合打瞌睡，他可不想揽活儿出门。几\n" +
        "老妪刚一进小院，撮嘴嘬嘬嘬的叫出了声。几6\n" +
        "“猫儿们，过来，都过来--\"\n" +
        "一声呼唤，整个小院都炸开了窝。\n" +
        "一时间，二三十条猫儿从小院各处蹿出，或是树上，或是井边，或是房上。\n" +
        "总而言之，这小院里你但凡能见到的地方，都有猫蹿出来。\n" +
        "这二三十条猫什么样的都有，白的、黑的、花的、胖的、瘦的、老的、小的。一时间，老妪和那刘老爷被群猫包围，喵声连成一片，更有自来熟的凑到老妪和刘老爷面前，歪着脑袋去蹭两人的裤腿和鞋面。",
        "刘府，后宅。\n" +
        "“猫儿，到地方了。\n" +
        "刘管家将猫笼放在地上，打开猫笼的笼口，李茂从猫笼里走出来，走了几步才停蹲坐在地上，抬头嗅着空气中的味道。\n" +
        "唔\n" +
        "草木气浓郁，水汽大，除此以外就是木头受潮后的潮味儿，至于耗子的味道，暂时还没闻见。\n" +
        "品完了味道，他这才端详起面前的环境来，。\n" +
        "帘\n" +
        "映入眼帘的是一扇月亮拱门，拱门上爬满了藤萝，向下垂落的藤萝枝蔓好似门\n" +
        "目光越过拱门，向里看去，却是大户人家养育女儿的深闺小院。\n" +
        "院里有一栋小楼，楼前是一颗开的正盛的杏花树，杏花树下还有随着秋风摇晃的秋干。\n" +
        "不过，最让人在意的还是院内丛生的杂草，郁郁葱葱，几乎与人膝盖同高。\n" +
        "今天的工作地点就是这里?\n" +
        "李茂扭头向刘府管家投去问询目光，可刘管家却已经收起了猫笼，后撤几步，一副随时准备要跑的模样。\n" +
        "李茂眼梢一挑，不是，这么大个人，还怕老鼠?"
      ]
    }
  },
  methods:{
    next(){
      this.num = this.num + 1
      let word = "第" + this.num + "章"
      this.title = word
    },
    back(){
      this.num = this.num - 1
      let word = "第" + this.num + "章"
      this.title = word
    }
  }
}
</script>

<template>
  <div>
    <div style="font-size: 50px;color: black;margin: 50px" class="center">
      <span>{{ this.title}}</span>
    </div>
    <div>
      <div style="margin-left: 500px;margin-right:500px;">
        {{ this.text[this.num -1] }}
      </div>
    </div>
    <div class="center" style="margin-top: 50px">
      <el-button @click="back">上一章</el-button>
      <el-button @click="next">下一章</el-button>
    </div>
  </div>
</template>

<style>
.center{
  display: flex;
  align-items: center;
  justify-content: center;
}
</style>